02_art_share_api/app/controllers/users_controller.rb

	def create
		user = User.new(params.require(:user).permit(:name, :email))
		if user.save
---
INSERT INTO "users" ("created_at", "updated_at", "name", "email") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2019-01-25 06:23:00.768623"], ["updated_at", "2019-01-25 06:23:00.768623"], ["name", "Micheal"], ["email", "mkass@42.com"]]